Repository: thomassimmer/Flutter-Actix-App
Catalog: frontend/lib/l10n/app_*.arb
Languages: fr

# alreadyAnAccountLogin
source: Already have an account? Sign in
fr: Déjà un compte ? Connectez-vous

source: About
fr: À propos

# aboutText
source: This application is proposed to you by Thomas Simmer.
fr: Cette application vous est proposée par Thomas Simmer.

source: Cancel
fr: Annuler

source: Change Password
fr: Changer mon mot de passe

source: Challenges
fr: Défis

source: Come Back
fr: Revenir en arrière

source: Current password
fr: Mot de passe actuel

source: Dark
fr: Sombre

# defaultError
source: An error occurred. Please try again.
fr: Une erreur s'est produite. Veuillez réessayer.

# disableTwoFA
source: Disable
fr: Désactiver

source: Enable
fr: Activer

# enterOneTimePassword
source: Enter the 6-digit code generated by your app to confirm your authentication.
fr: Entrez le code à 6 chiffres généré par votre application pour confirmer votre authentification.

# enterPassword
source: Enter your password.
fr: Entrez votre mot de passe.

# enterRecoveryCode
source: Enter one of your recovery codes.
fr: Entrez un de vos codes de récupération.

# enterUsername
source: Enter your username.
fr: Entrez votre nom d'utilisateur.

# enterValidationCode
source: Enter the code from your authentication app.
fr: Entrez le code de votre application d'authentification.

source: Failed to load profile
fr: Impossible de charger le profil.

# forbiddenError
source: You are not authorized to perform this action.
fr: Vous n'êtes pas autorisé à effectuer cette action.

# generateNewQrCode
source: Generate a new QR code
fr: Générer un nouveau QR-code

# goToTwoFASetup
source: Set up two-factor authentication
fr: Activer

source: Habits
fr: Habitudes

# hello
source: Hello {userName}
fr: Bonjour {userName}

source: Home
fr: Accueil

# internalServerError
source: An internal server error occurred. Please try again.
fr: Une erreur interne du serveur s'est produite. Veuillez réessayer.

# invalidOneTimePasswordError
source: Invalid one-time password. Please try again.
fr: Mot de passe à usage unique invalide. Veuillez réessayer.

# invalidRequestError
source: The request you made was not accepted by the server.
fr: La demande que vous avez effectuée n'a pas été acceptée par le serveur.

# invalidResponseError
source: The response from the server could not be processed.
fr: La réponse du serveur n'a pas pu être traitée.

# invalidUsernameOrCodeOrRecoveryCodeError
source: Invalid username, one-time password, or recovery code. Please try again.
fr: Nom d'utilisateur, mot de passe à usage unique ou code de récupération invalide. Veuillez réessayer.

# invalidUsernameOrPasswordError
source: Invalid username or password. Please try again.
fr: Nom d'utilisateur ou mot de passe invalide. Veuillez réessayer.

# invalidUsernameOrPasswordOrRecoveryCodeError
source: Invalid username, password, or recovery code. Please try again.
fr: Nom d'utilisateur, mot de passe ou code de récupération invalide. Veuillez réessayer.

# invalidUsernameOrRecoveryCodeError
source: Invalid username or recovery code. Please try again.
fr: Nom d'utilisateur ou code de récupération invalide. Veuillez réessayer.

# keepRecoveryCodesSafe
source: Please keep these recovery codes safe. They are necessary if you lose your password or access to your 2FA application.
fr: Merci de garder ces codes de récupération bien à l'abri. Ils seront nécessaires si vous perdez votre mot de passe ou l'acès à votre application d'authentification.

source: Language
fr: Langue

source: Light
fr: Clair

source: Log In
fr: Se connecter

# loginSuccessful
source: You successfully logged in.
fr: Vous êtes bien connecté.

source: Log out
fr: Se déconnecter

# logoutSuccessful
source: You successfully logged out.
fr: Vous vous êtes bien déconnecté.

source: New password
fr: Nouveau mot de passe

source: Next
fr: Suivant

# noAccountCreateOne
source: No account? Create one here.
fr: Pas de compte ? Créez-le ici.

# noContent
source: No content to display
fr: Aucun contenu à afficher

# noRecoveryCodeAvailable
source: No recovery codes available.
fr: Aucun code de récupération disponible.

source: Password
fr: Mot de passe

# passwordForgotten
source: Forgot your password?
fr: Vous avez oublié votre mot de passe ?

# passwordMustBeChangedError
source: You need to change your password to log in.
fr: Votre mot de passe doit être changé pour pouvoir vous connecter.

# passwordNotComplexEnough
source: Your password must contain at least a letter, a digit, and a special character.
fr: Votre mot de passe doit contenir au moins une lettre, un chiffre et un caractère spécial.

# passwordNotExpiredError
source: Your password is not expired, so it cannot be changed this way.
fr: Votre mot de passe n'est pas expiré. Vous ne pouvez pas le changer de cette manière.

# passwordTooShortError
source: Your password must be at least 8 characters long.
fr: Votre mot de passe doit contenir au moins 8 caractères.

# passwordUpdateSuccessful
source: Your password was successfully updated.
fr: Votre mot de passe a bien été mis à jour

# pleaseLoginOrSignUp
source: Please log in or sign up to continue.
fr: Merci de vous connecter ou de vous inscrire pour continuer.

source: Profile
fr: Profil

source: Profile Settings
fr: Paramètres du profil

# profileUpdateSuccessful
source: Profile information saved.
fr: Vos informations ont bien été sauvegardées.

# qrCodeSecretKeyCopied
source: QR code secret key copied to clipboard.
fr: La clé secrète du QR-code a été copiée dans le presse-papiers.

source: Recover Account
fr: Récupération de compte

source: Recovery code
fr: Code de récupération

# recoveryCodesCopied
source: Recovery codes copied to clipboard.
fr: Les codes de récupération ont été copiés dans le presse-papiers.

# refreshTokenExpiredError
source: Your session has expired. Please log in again.
fr: Votre session a expiré. Veuillez vous reconnecter.

source: Regenerate QR code
fr: Régénérer un QR-code

source: Save
fr: Enregistrer

source: Select Language
fr: Sélection de la langue

source: Select Theme
fr: Sélection du thème

# setNewPassword
source: Enter your new password.
fr: Renseignez votre nouveau mot de passe.

source: Sign Up
fr: S'inscrire

source: Theme
fr: Thème

# twoFA
source: Two-Factor Authentication
fr: Authentification à deux facteurs

# twoFAInvitation
source: Security and privacy are our top priorities. Please set up two-factor authentication to protect your account from brute-force attacks.
fr: La sécurité et la confidentialité sont nos principales priorités. Veuillez activer l'authentification à deux facteurs pour protéger votre compte des attaques par force brute.

# twoFAIsWellSetup
source: Two-Factor Authentication is successfully set up for your account.
fr: L'authentification à deux facteurs est correctement configurée sur votre compte.

# twoFAScanQrCode
source: Scan this QR code with your authentication app.
fr: Scannez ce QR-code dans votre application d'authentification.

# twoFASecretKey
source: Your secret key is: {secretKey}
fr: Votre clé secrète est : {secretKey}

# twoFASetup
source: Enable two-factor authentication to secure your account.
fr: Activez l'authentification à deux facteurs pour sécuriser votre compte.

# twoFactorAuthenticationNotEnabledError
source: Two-factor authentication is not enabled for your account.
fr: L'authentification à deux facteurs n'est pas activée sur votre compte.

source: Unable to load recovery codes.
fr: Impossible de charger les codes de récupération.

# unauthorizedError
source: You are not authorized to perform this action.
fr: Vous n'êtes pas autorisé à effectuer cette opération.

# unknownError
source: An unexpected error occurred. Please try again.
fr: Une erreur inattendue s'est produite. Veuillez réessayer.

# updatePassword
source: Enter your current and new password.
fr: Renseignez votre mot de passe actuel et le nouveau.

# userAlreadyExistingError
source: A user with this username already exists. Please choose another.
fr: Un utilisateur avec ce nom d'utilisateur existe déjà. Veuillez en choisir un autre.

# userNotFoundError
source: User not found.
fr: Utilisateur non trouvé.

source: Username
fr: Nom d'utilisateur

# usernameNotRespectingRulesError
source: Your username must follow these rules: - Start and end with a letter or digit - Allowed special characters are . _ - - No consecutive special characters
fr: Votre nom d'utilisateur doit respecter ces règles : - commencer et finir par une lettre ou un chiffre - les caractères spéciaux autorisés sont . _ - - pas de caractères spéciaux consécutifs.

# usernameWrongSizeError
source: Username length must be between 3 and 20 characters.
fr: La longueur de votre nom d'utilisateur doit être comprise entre 3 et 20 caractères.

source: Validation code
fr: Code de validation

# validationCodeCorrect
source: Your validation code is correct!
fr: Votre code de validation est correct !

source: Verify
fr: Vérifier

# welcome
source: Welcome on the Flutter Actix App.
fr: Bienvenue sur Flutter Actix App.

source: Previous
fr: Précédent
